spec/fixtures/vcr_cassettes/ogone/visa_payment_20_euros.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: orderID=1a6ef05f229c704714b4db25c6da0a&CN=John+Doe&CARDNO=4111111111111111&ED=1012&CVC=111&currency=EUR&amount=2000&PSPID=jilion&USERID=sublime&PSWD=WWQMNC89&Operation=SAL&SHASign=801772DBE8B4F350B58689E925100AF4FE8B87293A11D9B8AAF96E77AC9263381C7A4815D0B52775F6AC9A0B15CD2ED2B136CD409910A8DB50547ECD84277FC1
    headers:
      content-type:
      - application/x-www-form-urlencoded
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      date:
      - Mon, 03 Oct 2011 10:17:56 GMT
      server:
      - Microsoft-IIS/6.0
      x-powered-by:
      - ASP.NET
      content-length:
      - '304'
      content-type:
      - text/html
      cache-control:
      - private
    body: ! "<?xml version=\"1.0\"?>\r\n<ncresponse\r\n\t\t\t\r\norderID=\"1a6ef05f229c704714b4db25c6da0a\"\r\nPAYID=\"0\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001122\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\nECI=\"7\"\r\namount=\"20\"\r\ncurrency=\"EUR\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nNCERRORPLUS=\"The
      currency is not accepted by the merchant:EUR\">\r\n</ncresponse>\r\n"
    http_version: '1.1'
