spec/fixtures/vcr_cassettes/ogone/visa_payment_generic.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: Operation=SAL&CN=John+Doe&orderID=a53483354341a5a218534ad0628b6d&amount=1000&CVC=111&USERID=sublime&CARDNO=4111111111111111&PSWD=WWQMNC89&currency=USD&ED=1011&PSPID=jilion
    headers:
      accept:
      - ! '*/*'
      content-type:
      - application/x-www-form-urlencoded
      connection:
      - close
      content-length:
      - '171'
      host:
      - secure.ogone.com
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      x-powered-by:
      - ASP.NET
      connection:
      - close
      content-type:
      - text/html
      date:
      - Thu, 10 Jun 2010 13:56:47 GMT
      server:
      - Microsoft-IIS/6.0
      content-length:
      - '317'
      cache-control:
      - private
    body: ! '<?xml version="1.0"?><ncresponse

      orderID="a53483354341a5a218534ad0628b6d"

      PAYID="7476601"

      NCSTATUS="0"

      NCERROR="0"

      NCERRORPLUS="!"

      ACCEPTANCE="test123"

      STATUS="9"

      IPCTY="99"

      CCCTY="US"

      ECI="7"

      CVCCheck="NO"

      AAVCheck="NO"

      VC="NO"

      amount="10"

      currency="USD"

      PM="CreditCard"

      BRAND="VISA">

      </ncresponse>'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: http://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:80/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json
    body: ! '{"EmailAddress":"email10@user.com","Name":"John Doe","CustomFields":[{"Key":"user_id","Value":2},{"Key":"segment","Value":"test"}],"Resubscribe":true}'
    headers:
      user-agent:
      - createsend-ruby-0.6.1
      content-type:
      - application/json
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 201
      message: Created
    headers:
      cache-control:
      - private, s-maxage=0
      content-type:
      - application/json; charset=utf-8
      server:
      - CMWEB04
      x-aspnetmvc-version:
      - '2.0'
      x-aspnet-version:
      - 4.0.30319
      x-powered-by:
      - ASP.NET
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 21 Mar 2011 19:00:02 GMT
      content-length:
      - '18'
    body: ! '"email10@user.com"'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json
    body: ! '{"EmailAddress":"email134@user.com","Name":"John Doe","CustomFields":[{"Key":"user_id","Value":1},{"Key":"segment","Value":"test"},{"Key":"beta","Value":"false"}],"Resubscribe":true}'
    headers:
      user-agent:
      - createsend-ruby-0.8.1
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 201
      message: Created
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 172.20.3.24
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Wed, 09 Nov 2011 15:50:09 GMT
      content-length:
      - '19'
    body: ! '"email134@user.com"'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json
    body: ! '{"EmailAddress":"email135@user.com","Name":"John Doe","CustomFields":[{"Key":"user_id","Value":2},{"Key":"segment","Value":"test"},{"Key":"beta","Value":"false"}],"Resubscribe":true}'
    headers:
      user-agent:
      - createsend-ruby-0.8.1
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 201
      message: Created
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 172.20.3.23
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Wed, 09 Nov 2011 15:51:03 GMT
      content-length:
      - '19'
    body: ! '"email135@user.com"'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json
    body: ! '{"EmailAddress":"email137@user.com","Name":"John Doe","CustomFields":[{"Key":"user_id","Value":4},{"Key":"segment","Value":"test"},{"Key":"beta","Value":"false"}],"Resubscribe":true}'
    headers:
      user-agent:
      - createsend-ruby-0.8.1
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 201
      message: Created
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 172.20.3.26
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Wed, 09 Nov 2011 15:50:18 GMT
      content-length:
      - '19'
    body: ! '"email137@user.com"'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json
    body: ! '{"EmailAddress":"email139@user.com","Name":"John Doe","CustomFields":[{"Key":"user_id","Value":6},{"Key":"segment","Value":"test"},{"Key":"beta","Value":"false"}],"Resubscribe":true}'
    headers:
      user-agent:
      - createsend-ruby-0.8.1
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 201
      message: Created
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 172.20.3.25
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Wed, 09 Nov 2011 15:50:08 GMT
      content-length:
      - '19'
    body: ! '"email139@user.com"'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1323@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - cf26f7c5d2c145c44fc88c3428f020d0
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:42 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1323@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 9ef49f8657f83d34e8e633bb4b803561
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:49 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1330@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - a710208ebad601232c7775c67eaae2e1
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:46 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1330@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 61f7521bff0f6982dccb049cf86da030
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:52 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1331@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - f5a423776d4e0709450a9813dd10d5c4
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:37 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://8844ec1803ffbe6501c3d7e9cfa23bf3:x@api.createsend.com:443/api/v3/subscribers/a064dfc4b8ccd774252a2e9c9deb9244.json?email=email1331@user.com
    body: 
    headers:
      user-agent:
      - createsend-ruby-1.0.3
      content-type:
      - application/json; charset=utf-8
      accept-encoding:
      - gzip, deflate
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 400
      message: Bad Request
    headers:
      server:
      - csw
      cache-control:
      - private, s-maxage=0
      x-cs-node:
      - 61f7521bff0f6982dccb049cf86da030
      content-type:
      - application/json; charset=utf-8
      p3p:
      - CP="OTI DSP COR CUR IVD CONi OTPi OUR IND UNI STA PRE"
      date:
      - Mon, 20 Feb 2012 15:30:54 GMT
      content-length:
      - '76'
    body: ! '{"Code":203,"Message":"Subscriber not in list or has already been removed."}'
    http_version: '1.1'
