spec/fixtures/vcr_cassettes/ogone/visa_refund_failed.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=RFD&PAYID=23934746&PSPID=jilion&PSWD=WWQMNC89&SHASign=31E6BC3AFE5585DF16E370AD70EDFE0CA96D4A8120934CC48128485818AB35269AD3D720F4EADC33857DED3EB94412338912A0BF0EA5B01DC3C8686DE49587B4&USERID=sublime&amount=3000&currency=USD
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 12:24:25 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '266'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 12:23:25 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869019503_1711176;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"5dd235d0ec033be7145a8cf7097920\"\r\nPAYID=\"23934746\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001129\"\r\nNCERRORPLUS=\"Overflow
        in refunds requests/10/10\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"30\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 12:24:25 GMT
recorded_with: VCR 2.6.0
