spec/fixtures/vcr_cassettes/ogone_visa_payment_2000_alias.yml

--- 
- !ruby/struct:VCR::HTTPInteraction 
  request: !ruby/struct:VCR::Request 
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: Operation=SAL&ECI=9&orderID=91781753b2484f2f1f8cf450576304&amount=2000&ALIAS=sublime_33&USERID=sublime&PSWD=WWQMNC89&currency=USD&PSPID=jilion
    headers: 
      accept: 
      - "*/*"
      content-type: 
      - application/x-www-form-urlencoded
      connection: 
      - close
      content-length: 
      - "142"
      host: 
      - secure.ogone.com
  response: !ruby/struct:VCR::Response 
    status: !ruby/struct:VCR::ResponseStatus 
      code: 200
      message: OK
    headers: 
      x-powered-by: 
      - ASP.NET
      connection: 
      - close
      content-type: 
      - text/html
      date: 
      - Thu, 10 Jun 2010 14:09:23 GMT
      server: 
      - Microsoft-IIS/6.0
      content-length: 
      - "336"
      cache-control: 
      - private
    body: |-
      <?xml version="1.0"?><ncresponse
      orderID="91781753b2484f2f1f8cf450576304"
      PAYID="7476714"
      NCSTATUS="0"
      NCERROR="0"
      NCERRORPLUS="!"
      ACCEPTANCE="test123"
      STATUS="5"
      IPCTY="99"
      CCCTY="US"
      ECI="9"
      CVCCheck="NO"
      AAVCheck="NO"
      VC="NO"
      amount="20"
      currency="USD"
      PM="CreditCard"
      BRAND="VISA" ALIAS="sublime_33">
      </ncresponse>
    http_version: "1.1"
