spec/fixtures/vcr_cassettes/ogone_visa_payment_20_euros.yml

--- 
- !ruby/struct:VCR::HTTPInteraction 
  request: !ruby/struct:VCR::Request 
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: orderID=9796eeda0e0cfdeae6ee64a9a08579&CN=John+Doe&CARDNO=4111111111111111&ED=1012&CVC=111&currency=EUR&amount=2000&PSPID=jilion&USERID=sublime&PSWD=WWQMNC89&Operation=SAL
    headers: 
      content-type: 
      - application/x-www-form-urlencoded
  response: !ruby/struct:VCR::Response 
    status: !ruby/struct:VCR::ResponseStatus 
      code: 200
      message: OK
    headers: 
      date: 
      - Tue, 04 Jan 2011 08:00:01 GMT
      server: 
      - Microsoft-IIS/6.0
      x-powered-by: 
      - ASP.NET
      content-length: 
      - "304"
      content-type: 
      - text/html
      cache-control: 
      - private
    body: |
      <?xml version="1.0"?>
      <ncresponse
      			
      orderID="9796eeda0e0cfdeae6ee64a9a08579"
      PAYID="0"
      NCSTATUS="5"
      NCERROR="50001122"
      ACCEPTANCE=""
      STATUS="0"
      ECI="0"
      amount="20"
      currency="EUR"
      PM="CreditCard"
      BRAND="VISA"
      NCERRORPLUS="The currency is not accepted by the merchant:EUR">
      </ncresponse>

    http_version: "1.1"
